taboadaa/ShuQi/nRF/Packages/.cache/Keil.LPC800_DFP.1.5.0.pdsc
        <!-- *************************  Device 'LPC812M101JD20'  ***************************** -->
        <device Dname="LPC812M101JD20">
          <compile header="Device/Include/LPC8xx.h"  define="LPC812M101JD20"/>
          <debug svd="SVD/LPC800.svd"/>
          <memory id="IROM1"                    start="0x00000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                    start="0x10000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/LPC8xx_16.FLM" start="0x00000000" size="0x00004000" RAMstart="0x10000000" RAMsize="0x0FE0" default="1"/>

          <feature type="USART"         n="2"/>
          <feature type="SPI"           n="1"/>
          <feature type="IOs"           n="18"/>
          <feature type="PackageOther"  n="20"        name="SO Package"/>
        </device>

        <!-- *************************  Device 'LPC812M101JDH20'  ***************************** -->
        <device Dname="LPC812M101JDH20">
          <compile header="Device/Include/LPC8xx.h"  define="LPC812M101JDH20"/>
          <debug svd="SVD/LPC800.svd"/>
          <memory id="IROM1"                    start="0x00000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                    start="0x10000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/LPC8xx_16.FLM" start="0x00000000" size="0x00004000" RAMstart="0x10000000" RAMsize="0x0FE0" default="1"/>

          <feature type="USART"         n="3"/>
          <feature type="SPI"           n="2"/>
          <feature type="IOs"           n="18"/>
          <feature type="SOP"           n="20"        name="SSOP Package"/>
        </device>

        <!-- *************************  Device 'LPC812M101JTB16'  ***************************** -->
        <device Dname="LPC812M101JTB16">
          <compile header="Device/Include/LPC8xx.h"  define="LPC812M101JTB16"/>
          <debug svd="SVD/LPC800.svd"/>
          <memory id="IROM1"                    start="0x00000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                    start="0x10000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/LPC8xx_16.FLM" start="0x00000000" size="0x00004000" RAMstart="0x10000000" RAMsize="0x0FE0" default="1"/>

          <feature type="USART"         n="3"/>
          <feature type="SPI"           n="2"/>
          <feature type="IOs"           n="14"/>
          <feature type="PackageOther"  n="16"        name="SON Package"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'LPC82x'  **************************** -->
      <subFamily DsubFamily="LPC82x">
        <processor Dclock="30000000"/>

        <book name="Documents/UM10800.pdf" title="LPC82x User manual"/>
        <book name="Documents/LPC82X.pdf"  title="LPC82x Datasheet"/>
        <description>
The LPC82x are an ARM Cortex-M0+ based, low-cost 32-bit MCU family operating at CPU frequencies of up to 30 MHz.
The LPC82x support up to 32 KB of flash memory and 8 KB of SRAM.
The peripheral complement of the LPC82x includes a CRC engine, four I2C-bus interfaces, up to three USARTs, up to two SPI interfaces, one multi-rate timer, self-wake-up timer, and state-configurable timer with PWM function (SCTimer/PWM), a DMA, one 12-bit ADC and one analog comparator, function-configurable I/O ports through a switch matrix, an input pattern match engine, and up to 29 general-purpose I/O pins.
        </description>

        <feature type="I2C"           n="4"/>
        <feature type="USART"         n="3"/>
        <feature type="SPI"           n="2"/>
        <feature type="WDT"           n="1"                           name="Windowed Watchdog timer"/>
        <feature type="Timer"         n="4"                           name="32-Bit Timer with Input Capture, Output Compare and PWM"/>
        <feature type="ADC"           n="1"       m="12"              name="ADC"/>
        <feature type="AnalogOther"   n="1"                           name="Comparator"/>
        <feature type="CoreOther"     n="1"                           name="CRC engine"/>
        <feature type="CoreOther"     n="1"                           name="Unique device serial number"/>

        <!-- *************************  Device 'LPC824M201JHI33'  ***************************** -->
        <device Dname="LPC824M201JHI33">
          <compile header="Device/Include/LPC8xx.h"  define="LPC824M201JHI33"/>
          <debug svd="SVD/LPC82x.svd"/>
          <memory id="IROM1"                    start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                    start="0x10000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/LPC8xx_32.FLM" start="0x00000000" size="0x00008000" RAMstart="0x10000000" RAMsize="0x0FE0" default="1"/>

          <feature type="IOs"           n="29"/>
          <feature type="QFN"           n="33"        name="QFN Package"/>
        </device>

        <!-- *************************  Device 'LPC824M201JDH20'  ***************************** -->
        <device Dname="LPC824M201JDH20">
          <compile header="Device/Include/LPC8xx.h"  define="LPC824M201JDH20"/>
          <debug svd="SVD/LPC82x.svd"/>
          <memory id="IROM1"                    start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                    start="0x10000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/LPC8xx_32.FLM" start="0x00000000" size="0x00008000" RAMstart="0x10000000" RAMsize="0x0FE0" default="1"/>

          <feature type="IOs"           n="18"/>
          <feature type="SOP"           n="20"        name="SSOP Package"/>
        </device>

        <!-- *************************  Device 'LPC822M101JHI33'  ***************************** -->
        <device Dname="LPC822M101JHI33">
          <compile header="Device/Include/LPC8xx.h"  define="LPC822M101JHI33"/>
          <debug svd="SVD/LPC82x.svd"/>
          <memory id="IROM1"                    start="0x00000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                    start="0x10000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/LPC8xx_16.FLM" start="0x00000000" size="0x00004000" RAMstart="0x10000000" RAMsize="0x0FE0" default="1"/>

