taboadaa/ShuQi/nRF/Packages/.cache/Keil.LPC800_DFP.1.5.0.pdsc
              // Disable Reset Vector Catch in DEMCR
              value = Read32(DEMCR_Addr);
              Write32(DEMCR_Addr, (value &amp; (~0x00000001)));

              //Clear BP0 and FPB
              Write32(0xE0002008, 0);                           // Clear BP0
              Write32(0xE0002000, 0x00000002);                  // Disable FPB
            </block>
          </sequence>

        </sequences>

        <feature type="SPI"           n="2"/>
        <feature type="WDT"           n="1"                           name="Windowed Watchdog timer"/>
        <feature type="Timer"         n="4"                           name="32-Bit Timer with Input Capture, Output Compare and PWM"/>
        <feature type="ADC"           n="1"       m="12"/>
        <feature type="CoreOther"     n="1"                           name="CRC engine"/>
        <feature type="CoreOther"     n="1"                           name="Unique device serial number"/>

        <!-- *************************  Device 'LPC844M201JBD48'  ***************************** -->
        <device Dname="LPC844M201JBD48">
          <compile header="Device/Include/LPC84x.h" define="LPC844M201JBD48"/>
          <debug svd="SVD/LPC84x.svd"/>
          <memory id="IROM1"                    start="0x00000000" size="0x00010000" default="1" startup="1"/>
          <memory id="IRAM1"                    start="0x10000000" size="0x00002000" default="1" init   ="0"/>
          <algorithm name="Flash/LPC84x_64.FLM" start="0x00000000" size="0x00010000" default="1"/>

          <feature type="I2C"           n="2"/>
          <feature type="USART"         n="2"/>
          <feature type="IOs"           n="42"/>
          <feature type="QFP"           n="48"                        name="QFP Package"/>
        </device>

        <!-- *************************  Device 'LPC844M201JBD64'  ***************************** -->
        <device Dname="LPC844M201JBD64">
          <compile header="Device/Include/LPC84x.h" define="LPC844M201JBD64"/>
          <debug svd="SVD/LPC84x.svd"/>
          <memory id="IROM1"                    start="0x00000000" size="0x00010000" default="1" startup="1"/>
          <memory id="IRAM1"                    start="0x10000000" size="0x00002000" default="1" init   ="0"/>
          <algorithm name="Flash/LPC84x_64.FLM" start="0x00000000" size="0x00010000" default="1"/>

          <feature type="I2C"           n="2"/>
          <feature type="USART"         n="2"/>
          <feature type="IOs"           n="54"/>
          <feature type="QFP"           n="64"                        name="QFP Package"/>
        </device>

        <!-- *************************  Device 'LPC844M201JHI33'  ***************************** -->
        <device Dname="LPC844M201JHI33">
          <compile header="Device/Include/LPC84x.h" define="LPC844M201JHI33"/>
          <debug svd="SVD/LPC84x.svd"/>
          <memory id="IROM1"                    start="0x00000000" size="0x00010000" default="1" startup="1"/>
          <memory id="IRAM1"                    start="0x10000000" size="0x00002000" default="1" init   ="0"/>
          <algorithm name="Flash/LPC84x_64.FLM" start="0x00000000" size="0x00010000" default="1"/>

          <feature type="I2C"           n="2"/>
          <feature type="USART"         n="2"/>
          <feature type="IOs"           n="29"/>
          <feature type="QFN"           n="33"                        name="QFN Package"/>
        </device>

        <!-- *************************  Device 'LPC844M201JHI48'  ***************************** -->
        <device Dname="LPC844M201JHI48">
          <compile header="Device/Include/LPC84x.h" define="LPC844M201JHI48"/>
          <debug svd="SVD/LPC84x.svd"/>
          <memory id="IROM1"                    start="0x00000000" size="0x00010000" default="1" startup="1"/>
          <memory id="IRAM1"                    start="0x10000000" size="0x00002000" default="1" init   ="0"/>
          <algorithm name="Flash/LPC84x_64.FLM" start="0x00000000" size="0x00010000" default="1"/>

          <feature type="I2C"           n="2"/>
          <feature type="USART"         n="2"/>
          <feature type="IOs"           n="42"/>
          <feature type="QFN"           n="48"                        name="QFN Package"/>
        </device>

        <!-- *************************  Device 'LPC845M301JBD48'  ***************************** -->
        <device Dname="LPC845M301JBD48">
          <compile header="Device/Include/LPC84x.h" define="LPC845M301JBD48"/>
          <debug svd="SVD/LPC84x.svd"/>
          <memory id="IROM1"                    start="0x00000000" size="0x00010000" default="1" startup="1"/>
          <memory id="IRAM1"                    start="0x10000000" size="0x00004000" default="1" init   ="0"/>
          <algorithm name="Flash/LPC84x_64.FLM" start="0x00000000" size="0x00010000" default="1"/>

          <feature type="I2C"           n="4"/>
          <feature type="USART"         n="5"/>
          <feature type="DAC"           n="2"       m="10"/>
          <feature type="CoreOther"     n="1"                         name="Capacitive Touch Interface"/>
          <feature type="IOs"           n="42"/>
          <feature type="QFP"           n="48"                        name="QFP Package"/>
        </device>

        <!-- *************************  Device 'LPC845M301JBD64'  ***************************** -->
        <device Dname="LPC845M301JBD64">
          <compile header="Device/Include/LPC84x.h" define="LPC845M301JBD64"/>
          <debug svd="SVD/LPC84x.svd"/>
          <memory id="IROM1"                    start="0x00000000" size="0x00010000" default="1" startup="1"/>
          <memory id="IRAM1"                    start="0x10000000" size="0x00004000" default="1" init   ="0"/>
          <algorithm name="Flash/LPC84x_64.FLM" start="0x00000000" size="0x00010000" default="1"/>

          <feature type="I2C"           n="4"/>
          <feature type="USART"         n="5"/>
          <feature type="DAC"           n="2"       m="10"/>
          <feature type="CoreOther"     n="1"                         name="Capacitive Touch Interface"/>
          <feature type="IOs"           n="54"/>
          <feature type="QFP"           n="64"                        name="QFP Package"/>
        </device>

