taboadaa/ShuQi/nRF/Packages/.cache/Keil.LPC800_DFP.1.5.0.pdsc
        <!-- *************************  Device 'LPC845M301JHI33'  ***************************** -->
        <device Dname="LPC845M301JHI33">
          <compile header="Device/Include/LPC84x.h" define="LPC845M301JHI33"/>
          <debug svd="SVD/LPC84x.svd"/>
          <memory id="IROM1"                    start="0x00000000" size="0x00010000" default="1" startup="1"/>
          <memory id="IRAM1"                    start="0x10000000" size="0x00004000" default="1" init   ="0"/>
          <algorithm name="Flash/LPC84x_64.FLM" start="0x00000000" size="0x00010000" default="1"/>

          <feature type="I2C"           n="4"/>
          <feature type="USART"         n="5"/>
          <feature type="DAC"           n="2"       m="10"/>
          <feature type="CoreOther"     n="1"                         name="Capacitive Touch Interface"/>
          <feature type="IOs"           n="29"/>
          <feature type="QFN"           n="33"                        name="QFN Package"/>
        </device>

        <!-- *************************  Device 'LPC845M301JHI48'  ***************************** -->
        <device Dname="LPC845M301JHI48">
          <compile header="Device/Include/LPC84x.h" define="LPC845M301JHI48"/>
          <debug svd="SVD/LPC84x.svd"/>
          <memory id="IROM1"                    start="0x00000000" size="0x00010000" default="1" startup="1"/>
          <memory id="IRAM1"                    start="0x10000000" size="0x00004000" default="1" init   ="0"/>
          <algorithm name="Flash/LPC84x_64.FLM" start="0x00000000" size="0x00010000" default="1"/>

          <feature type="I2C"           n="4"/>
          <feature type="USART"         n="5"/>
          <feature type="DAC"           n="2"       m="10"/>
          <feature type="CoreOther"     n="1"                         name="Capacitive Touch Interface"/>
          <feature type="IOs"           n="42"/>
          <feature type="QFN"           n="48"                        name="QFN Package"/>
        </device>

      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="LPC81x">
      <description>NXP LPC81x Devices</description>
      <require Dvendor="NXP:11" Dname="LPC81*"/>
    </condition>

    <condition id="LPC82x">
      <description>NXP LPC82x Devices</description>
      <require Dvendor="NXP:11" Dname="LPC82*"/>
    </condition>

    <condition id="LPC83x">
      <description>NXP LPC83x Devices</description>
      <require Dvendor="NXP:11" Dname="LPC83*"/>
    </condition>

    <condition id="LPC84x">
      <description>NXP LPC84x Devices</description>
      <require Dvendor="NXP:11" Dname="LPC84*"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="LPC81x CMSIS">
      <description>NXP LPC81x Devices and CMSIS-CORE</description>
      <require condition="LPC81x"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="LPC82x CMSIS">
      <description>NXP LPC82x Devices and CMSIS-CORE</description>
      <require condition="LPC82x"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="LPC83x CMSIS">
      <description>NXP LPC83x Devices and CMSIS-CORE</description>
      <require condition="LPC83x"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="LPC84x CMSIS">
      <description>NXP LPC84x Devices and CMSIS-CORE</description>
      <require condition="LPC84x"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
  </conditions>

  <components>
    <!-- Startup LPC81x -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.1" condition="LPC81x CMSIS">
      <description>System Startup for NXP LPC81x Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device/Include/"/>
        <!-- startup / system file -->
        <file category="source"  name="Device/Source/ARM/startup_LPC8xx.s" attr="config" version="1.0.1" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_LPC8xx.c"      attr="config" version="1.0.1"/>
      </files>
    </component>

    <!-- Startup LPC82x -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="LPC82x CMSIS">
      <description>System Startup for NXP LPC82x Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device/Include/"/>
        <!-- startup / system file -->
        <file category="source"  name="Device/Source/ARM/startup_LPC82x.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_LPC82x.c"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup LPC83x -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="LPC83x CMSIS">
      <description>System Startup for NXP LPC83x Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device/Include/"/>
        <!-- startup / system file -->
        <file category="source"  name="Device/Source/ARM/startup_LPC83x.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_LPC83x.c"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup LPC84x -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="LPC84x CMSIS">
      <description>System Startup for NXP LPC83x Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device/Include/"/>
        <!-- startup / system file -->
        <file category="source"  name="Device/Source/ARM/startup_LPC84x.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_LPC84x.c"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- LPC812 LPCXpresso Board Support -->
    <bundle Cbundle="LPC812 LPCXpresso" Cclass="Board Support" Cversion="1.0.0">
      <description>NXP LPC812 LPCXpresso Board</description>
      <doc></doc>
      <component Cgroup="LED" Capiversion="1.00" condition="LPC81x CMSIS">
      <description>LED driver for NXP LPC812 LPCXpresso Board</description>
        <files>
          <file category="source" name="Boards/NXP/LPC812-LPCXpresso/Common/LED_LPC812-LPCXpresso.c"/>
        </files>
      </component>
      <component Cgroup="Comparator" condition="LPC81x CMSIS">
      <description>Comparator driver for NXP LPC812 LPCXpresso Board</description>
        <files>
          <file category="source" name="Boards/NXP/LPC812-LPCXpresso/Common/Comparator_LPC812-LPCXpresso.c"/>
          <file category="header" name="Boards/NXP/LPC812-LPCXpresso/Common/Comparator_LPC812-LPCXpresso.h"/>
        </files>
      </component>
    </bundle>

    <!-- LPC824 LPCXpresso Board Support -->
    <bundle Cbundle="LPC824 LPCXpresso" Cclass="Board Support" Cversion="1.0.0">
      <description>NXP LPC824 LPCXpresso Board</description>
      <doc></doc>
      <component Cgroup="LED" Capiversion="1.00" condition="LPC82x CMSIS">
      <description>LED driver for NXP LPC824 LPCXpresso Board</description>
        <files>
          <file category="source" name="Boards/NXP/LPC824-LPCXpresso/Common/LED_LPC824-LPCXpresso.c"/>
        </files>
      </component>
    </bundle>

