taboadaa/ShuQi/nRF/Packages/.cache/Keil.LPC800_DFP.1.5.0.pdsc
    <!-- LPC84x LPCXpresso Board Support -->
    <bundle Cbundle="LPC84x LPCXpresso" Cclass="Board Support" Cversion="1.0.0">
      <description>NXP LPC84x LPCXpresso Board</description>
      <doc></doc>
      <component Cgroup="LED" Capiversion="1.0.0" condition="LPC84x CMSIS">
      <description>LED driver for NXP LPC84x LPCXpresso Board</description>
        <files>
          <file category="source" name="Boards/NXP/LPC84x-LPCXpresso/Common/LED_LPC84x-LPCXpresso.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.0.0" condition="LPC84x CMSIS">
      <description>Button driver for NXP LPC84x LPCXpresso Board Board</description>
        <files>
        <file category="sourceC" name="Boards/NXP/LPC84x-LPCXpresso/Common/Buttons_LPC84x-LPCXpresso.c"/>
        </files>
      </component>
    </bundle>

  </components>

  <boards>
    <board vendor="NXP" name="LPC812 LPCXpresso" revision="Rev. A" salesContact="http://www.nxp.com/support.html" orderForm="http://www.nxp.com/demoboard/OM13053.html#ordering">
      <description>NXP LPC812 LPCXpresso Board</description>
      <book category="overview"  name="http://www.nxp.com/demoboard/OM13053.html"  title="LPC812 LPCXpresso Board"/>
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="LPC812M101JDH20"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" DsubFamily="LPC81x"/>
      <feature type="XTAL"            n="12000000"/>
      <feature type="PWR"             n="5"              name="USB Powered"/>
      <feature type="Poti"            n="1"              name="Potentiometer for ADC Input"/>
      <feature type="LED"             n="1"              name="I/O Port RGB LED"/>
      <feature type="ODbg"            n="1"              name="LPC-Link"/>
    </board>

    <board vendor="NXP" name="LPC824 LPCXpresso" revision="Rev. A" salesContact="http://www.nxp.com/support.html">
      <description>NXP LPC824 LPCXpresso Board</description>
      <!--book category="overview"  name="http://www.nxp.com/demoboard/OM13053.html"  title="LPC812 LPCXpresso Board"/-->
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="LPC824M201JHI33"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" DsubFamily="LPC82x"/>
      <book category="setup" name="Documents/NXP824_Blinky_Lab.pdf" title="LPCXpresso824-MAX: Blinky Lab"/>
      <feature type="XTAL"            n="12000000"/>
      <feature type="PWR"             n="5"              name="USB Powered"/>
      <feature type="LED"             n="1"              name="I/O Port RGB LED"/>
      <feature type="Button"          n="3"              name="Reset, Wake, User button"/>
      <feature type="ODbg"            n="1"              name="LPC-Link"/>
      <debugInterface adapter="JTAG/SW" connector="10 pin Cortex debug (0.05 inch connector)"/>
    </board>

    <board vendor="NXP" name="LPC84x LPCXpresso" revision="Rev. A" salesContact="http://www.nxp.com/support.html">
      <description>NXP LPC84x LPCXpresso Board</description>
      <!--book category="overview"  name="http://www.nxp.com/demoboard/OM13053.html"  title="LPC812 LPCXpresso Board"/-->
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="LPC845M301JBD64"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" DsubFamily="LPC84x"/>
      <!--book category="setup" name="Documents/NXP824_Blinky_Lab.pdf" title="LPCXpresso824-MAX: Blinky Lab"/-->
      <feature type="XTAL"            n="12000000"/>
      <feature type="PWR"             n="5"              name="USB Powered"/>
      <feature type="LED"             n="1"              name="I/O Port RGB LED"/>
      <feature type="Button"          n="3"              name="Reset, Wake, ISP"/>
      <feature type="ODbg"            n="1"              name="LPC-Link"/>
      <debugInterface adapter="JTAG/SW" connector="10 pin Cortex debug (0.05 inch connector)"/>
    </board>
  </boards>

  <examples>
    <!-- LPC812 LPCXpresso Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/NXP/LPC812-LPCXpresso/RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="LPC812 LPCXpresso" vendor="NXP"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
    <example name="Blinky" doc="Abstract.txt" folder="Boards/NXP/LPC812-LPCXpresso/Blinky">
      <description>Blinky example</description>
      <board name="LPC812 LPCXpresso" vendor="NXP"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>

    <!-- LPC824 LPCXpresso Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/NXP/LPC824-LPCXpresso/RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="LPC824 LPCXpresso" vendor="NXP"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
    <example name="Blinky" doc="Abstract.txt" folder="Boards/NXP/LPC824-LPCXpresso/Blinky">
      <description>Blinky example</description>
      <board name="LPC824 LPCXpresso" vendor="NXP"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>

    <!-- LPC84x LPCXpresso Board -->
    <example name="CMSIS-RTOS2 Blinky" doc="Abstract.txt" folder="Boards/NXP/LPC84x-LPCXpresso/RTX5_Blinky">
      <description>CMSIS-RTOS2 based Blinky example</description>
      <board name="LPC84x LPCXpresso" vendor="NXP"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
  </examples>

</package>
